/**
 * Оператор switch
 */

const username = 'Mango';

/**
 * Виконай рефакторинг коду задачі використовуючи switch.
 *
 * Якщо до дедлайну 0 днів - виведи рядок "Today"
 * Якщо до дедлайну 1 день - виведи рядок "Tomorrow"
 * Якщо до дедлайну 2 дні - виведи рядок "Overmorrow"
 * Якщо до дедлайну 3+ днів - виведи рядок "Date in the future"
 */

const daysUntilDeadline = 5;

if (daysUntilDeadline === 0) {
  console.log('Today');
} else if (daysUntilDeadline === 1) {
  console.log('Tomorrow');
} else if (daysUntilDeadline === 2) {
  console.log('Overmorrow');
} else {
  console.log('Date in the future');
}

/**
 * Напиши скрипт вибору опції доставки товару.
 * Опція зберігається в змінній option: 1 - самовивіз, 2 - курʼєр, 3 - пошта
 *
 * В змінну message записати повідомлення залежно від опції.
 * - 'Ви зможете отримати товар завтра з 12:00 в нашому офісі'
 * - 'Курʼєр доставить замовлення завтра з 9:00 до 18:00'
 * - 'Посилка буде відправлена сьогодні'
 * - 'Вам зателефонує менеджер'
 */

const option = 1;
let message = '';

console.log(message);

/**
 * Напиши скрипт, який повідомляє користувача про підтримку браузера.
 * Назва браузера зберігається в змінній browser
 * Доступні браузери для підтримки: Chrome / Edge / Firefox / Safari / Opera
 *
 * В змінну result записати повідомлення:
 * браузер Chrome                  -> 'Це найпопулярніший браузер'
 * браузер Edge                    -> 'У тебе браузер від Microsoft'
 * браузер Firefox, Safari, Opera  -> 'Ми також підтримуємо цей браузер'
 * інші браузера                   -> 'Даний браузер не підтримується'
 */
